InformationRegisters/ikon_cost_ДетализацияЗатратСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ikon_cost_ДетализацияЗатратСебестоимости</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗатрата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗатрата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗабалансовая</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Материальные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трудозатраты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыСНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗабалансоваяУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МатериальныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТрудозатратыРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПостоянныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостатейныеПеременныеРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопРасходыРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьЗабалансоваяРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйУчет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВерсияРасчёта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасчёта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРазузлование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяРазузлованиеДопРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияПродукции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПартийПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартияЗатрата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПартийЗатрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗатрат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ikon_cost_СтруктураСебестоимостиФоновый/Ext/Module.bsl
// Модуль предназначен для итерационной подготовки
// регистра сведений ikon_cost_ДетализацияЗатратСебестоимости
// Версия: 0.1.1.267

#Область ПрограммныйИнтерфейс

// Предварительный расчёт кэша себестоимости за период (запускается в фоне)
//
// Параметры:
//   ПараметрыВыполнения - Структура:
//     * НачалоПериода - Дата - начало периода расчёта
//     * КонецПериода - Дата - конец периода расчёта
//     * СписокНоменклатуры - Массив - список номенклатуры для расчёта (необязательный, если не указан - получить из отчёта)
//     * ПринудительноПересчитать - Булево - пересчитать даже если кэш есть (по умолчанию Ложь)
//     * ОтборПоОрганизациям - Массив - список организаций для расчёта (необязательный)
//     * Итераций - Число(15,0) - количество всех итераций всех потоков длительной операции
//     * Потоков - Число(15,0) - количество потоков
//     * КодПотока - Число(15,0) - код потока
//
// Возвращаемое значение:
//   ТаблицаЗначений:
//     * Номенклатура - СправочникСсылка.Номенклатура
//     * Расчитано - Булево
//     * ДлительностьРасчета - Число(15,0) - в секундах
//
Функция ПредварительныйРасчётКэшаСебестоимости(Знач ПараметрыВыполнения) Экспорт

	НачалоПериода = ПараметрыВыполнения.НачалоПериода;
	КонецПериода = ПараметрыВыполнения.КонецПериода;
	ПринудительноПересчитать = ПараметрыВыполнения.Свойство("ПринудительноПересчитать")
		И ПараметрыВыполнения.ПринудительноПересчитать;

	// Список номенклатуры для расчёта
	// Поддерживаем два варианта ключа для совместимости: "СписокНоменклатуры" и "ОтборПоПродукции"
	СписокНоменклатуры = Неопределено;
	Если ПараметрыВыполнения.Свойство("СписокНоменклатуры") И ЗначениеЗаполнено(ПараметрыВыполнения.СписокНоменклатуры) Тогда
		СписокНоменклатуры = ПараметрыВыполнения.СписокНоменклатуры;
	ИначеЕсли ПараметрыВыполнения.Свойство("ОтборПоПродукции") И ЗначениеЗаполнено(ПараметрыВыполнения.ОтборПоПродукции) Тогда
		СписокНоменклатуры = ПараметрыВыполнения.ОтборПоПродукции;
	Иначе
		// Получаем список всей номенклатуры из отчёта за период
		СписокНоменклатуры = ПолучитьСписокНоменклатурыЗаПериод(НачалоПериода, КонецПериода);
	КонецЕсли;

	// Отбор по организациям
	ОтборПоОрганизациям = Неопределено;
	Если ПараметрыВыполнения.Свойство("ОтборПоОрганизациям") Тогда
		ОтборПоОрганизациям = ПараметрыВыполнения.ОтборПоОрганизациям;
	КонецЕсли;

	ВремяНачала = ТекущаяУниверсальнаяДата();

	// Формируем строку отборов для логирования
	СтрокаОтборов = "";
	Если ЗначениеЗаполнено(СписокНоменклатуры) Тогда
		СтрокаОтборов = СтрокаОтборов + СтрШаблон(", Номенклатура: %1 шт.", СписокНоменклатуры.Количество());
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтборПоОрганизациям) Тогда
		СтрокаОтборов = СтрокаОтборов + СтрШаблон(", Организации: %1 шт.", ОтборПоОрганизациям.Количество());
	КонецЕсли;

	// Создаём таблицу результатов
	РезультатыРасчета = Новый ТаблицаЗначений;
	РезультатыРасчета.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	РезультатыРасчета.Колонки.Добавить("Расчитано", Новый ОписаниеТипов("Булево"));
	РезультатыРасчета.Колонки.Добавить("ДлительностьРасчета", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 0)));

	// Цикл по номенклатуре
	Для Каждого ТекущаяНоменклатура Из СписокНоменклатуры Цикл

		ВремяНачалаНоменклатуры = ТекущаяУниверсальнаяДата();

		// Формируем массив из одной номенклатуры
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(ТекущаяНоменклатура);

		// Выполняем расчёт для одной номенклатуры
		РассчитаноУспешно = РассчитатьКэшПоНоменклатуре(
			НачалоПериода,
			КонецПериода,
			МассивНоменклатуры,
			ПринудительноПересчитать,
			ОтборПоОрганизациям);

		ВремяОкончанияНоменклатуры = ТекущаяУниверсальнаяДата();
		ДлительностьРасчета = Окр(ВремяОкончанияНоменклатуры - ВремяНачалаНоменклатуры, 0);

		// Добавляем строку результата
		СтрокаРезультата = РезультатыРасчета.Добавить();
		СтрокаРезультата.Номенклатура = ТекущаяНоменклатура;
		СтрокаРезультата.Расчитано = РассчитаноУспешно;
		СтрокаРезультата.ДлительностьРасчета = ДлительностьРасчета;
		
		// Во избежание избыточного потребления памяти и ее утечек при выполнении одной длительной операции
		// не следует сообщать прогресс более 100 раз.		
		ДлительныеОперации.СообщитьПрогресс(
			, 
			ТекущаяНоменклатура);

	КонецЦикла;

	// Логирование завершения
	ВремяВыполнения = ТекущаяУниверсальнаяДата() - ВремяНачала;
	КоличествоРассчитанных = 0;
	Для Каждого СтрокаРезультат Из РезультатыРасчета Цикл
		Если СтрокаРезультат.Расчитано Тогда
			КоличествоРассчитанных = КоличествоРассчитанных + 1;
		КонецЕсли;
	КонецЦикла;

	Возврат РезультатыРасчета;

КонецФункции

#КонецОбласти

#Область СлужебныеМетоды

// Выполняет расчёт кэша для указанной номенклатуры за период
//
// Параметры:
//   НачалоПериода - Дата - начало периода расчёта
//   КонецПериода - Дата - конец периода расчёта
//   СписокНоменклатуры - Массив - список СправочникСсылка.Номенклатура для расчёта
//   ПринудительноПересчитать - Булево - пересчитать даже если кэш есть
//   ОтборПоОрганизациям - Массив - список СправочникСсылка.Организации для расчёта (необязательный)
//
// Возвращаемое значение:
//   Булево - Истина если успешно
//
Функция РассчитатьКэшПоНоменклатуре(
	НачалоПериода,
	КонецПериода,
	СписокНоменклатуры,
	ПринудительноПересчитать = Ложь,
	ОтборПоОрганизациям = Неопределено)

	Попытка

		ВерсияКэша = ikon_cost_КэшированиеРасчётов.ВерсияАлгоритмаРасчёта();

		// === ШАГ 1: Проверка наличия кэша ===
		Если НЕ ПринудительноПересчитать Тогда
			// Проверяем наличие кэша для указанной продукции
			ЕстьКэш = ikon_cost_КэшированиеРасчётов.ЕстьДанныеВКэшеПоПродукции(
				НачалоПериода,
				ВерсияКэша,
				СписокНоменклатуры);

			Если ЕстьКэш Тогда
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'ikon_cost: Пропуск расчёта кэша'"),
					УровеньЖурналаРегистрации.Информация,
					,
					,
					СтрШаблон("Кэш уже существует за период: %1 - %2 (частичный)",
						НачалоПериода,
						КонецПериода));
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;

		// === ШАГ 2: Получение аналитики для отбора ===
		СписокАналитики = ikon_cost_КэшированиеРасчётов.ПолучитьАналитикуПоНоменклатуре(
			НачалоПериода,
			КонецПериода,
			СписокНоменклатуры);

		Если НЕ ЗначениеЗаполнено(СписокАналитики) Тогда
			// Нет выпусков по данной номенклатуре за период
			Возврат Истина;
		КонецЕсли;

		// === ШАГ 3: Очистка кэша перед расчётом ===
		ikon_cost_КэшированиеРасчётов.ОчиститьКэшПоПродукции(НачалоПериода, СписокАналитики);

		// === ШАГ 4: Подготовка параметров ===
		МенеджерВТ = Новый МенеджерВременныхТаблиц;
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		ДанныеПоСебестоимости = 3; // Управленческий учёт

		// КРИТИЧНО: Получаем схему КД для корректной работы стандартной функции ЗапросВыпущеннаяПродукция
		// Без СхемаКД запрос формируется без условий отбора по продукции
		СхемаРазузлования = Отчеты.ДеревоСебестоимостиПродукции.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		НастройкиРазузлования = СхемаРазузлования.НастройкиПоУмолчанию;

		// Параметры дерева
		ПараметрыДереваСебестоимости = СтруктураСебестоимости.ПараметрыДереваСебестоимости();
		ПараметрыДереваСебестоимости.Вставить("ИспользоватьПакетнуюОбработку", Истина);
		ПараметрыДереваСебестоимости.Вставить("ДинамическоеСчитывание", Ложь);
		ПараметрыДереваСебестоимости.Вставить("ТипРезультата", "МенеджерВременныхТаблиц");
		ПараметрыДереваСебестоимости.Вставить("Результат", МенеджерВТ);
		ПараметрыДереваСебестоимости.Вставить("ИспользоватьКэширование", Истина);
		ПараметрыДереваСебестоимости.Вставить("ПериодРасчёта", НачалоПериода);
		ПараметрыДереваСебестоимости.Вставить("ВерсияАлгоритма", ВерсияКэша);
		ПараметрыДереваСебестоимости.Вставить("ДатаОкончания", КонецПериода);

		// Параметры узла
		ПараметрыУзлаДереваСебестоимости = СтруктураСебестоимости.ПараметрыУзлаДереваСебестоимости();
		ПараметрыУзлаДереваСебестоимости.ИнтерактивнаяНастройка = Ложь;  // Используем программный режим для корректной передачи отборов
		ПараметрыУзлаДереваСебестоимости.СхемаКД = СхемаРазузлования;
		ПараметрыУзлаДереваСебестоимости.НастройкиКД = НастройкиРазузлования;

		// КРИТИЧНО: Для МенеджерВременныхТаблиц полуфабрикаты ОБЯЗАТЕЛЬНО нужны!
		// Без этого параметра полуфабрикаты не добавляются в результат,
		// и кэш остаётся пустым, т.к. материалы добавляются только на уровнях > 0
		ПараметрыДереваСебестоимости.Вставить("ДобавлятьПолуфабрикатыВРезультат", Истина);

		ПараметрыУзлаДереваСебестоимости.Отборы.ДанныеПоСебестоимости = ДанныеПоСебестоимости;
		ПараметрыУзлаДереваСебестоимости.Отборы.РазворачиватьДопРасходы = Истина;
		ПараметрыУзлаДереваСебестоимости.Отборы.ДатаНачала = НачалоПериода;  // Важно: дата начала для корректного отбора по периоду
		ПараметрыУзлаДереваСебестоимости.Отборы.ДатаОкончания = КонецПериода;
		ПараметрыУзлаДереваСебестоимости.Отборы.ВалютаУправленческогоУчета = ВалютаУправленческогоУчета;

		// === ШАГ 5: Установка отборов по продукции ===
		ПараметрыУзлаДереваСебестоимости.Отборы.Продукция = СписокНоменклатуры;

		Если ЗначениеЗаполнено(ОтборПоОрганизациям) Тогда
			ПараметрыУзлаДереваСебестоимости.Отборы.Организации = ОтборПоОрганизациям;
		КонецЕсли;

		// === ШАГ 6: Выполнение расчёта ===
		СтруктураСебестоимости.ПостроитьДеревоСебестоимости(ПараметрыДереваСебестоимости, ПараметрыУзлаДереваСебестоимости);

		// === ШАГ 7: Запись в кэш ===
		// Запись в кэш происходит внутри ПостроитьДеревоСебестоимости при ИспользоватьКэширование = Истина
		// Но для надёжности вызываем явно (функция проверит наличие данных в МенеджерВТ)
		ikon_cost_КэшированиеРасчётов.ЗаписатьРезультатВКэш(
			МенеджерВТ,
			НачалоПериода,
			ВерсияКэша,
			ДанныеПоСебестоимости,
			КонецПериода);

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ikon_cost: Расчёт кэша по номенклатуре'"),
			УровеньЖурналаРегистрации.Информация,
			,
			,
			СтрШаблон("Период: %1 - %2, Номенклатура: %3",
				НачалоПериода,
				КонецПериода,
				СписокНоменклатуры[0]));

		Возврат Истина;

	Исключение

		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ikon_cost: Ошибка расчёта кэша'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			СтрШаблон("Период: %1 - %2, Номенклатура: %3, Ошибка: %4",
				НачалоПериода,
				КонецПериода,
				?(ЗначениеЗаполнено(СписокНоменклатуры), СписокНоменклатуры[0], "Н/Д"),
				ОписаниеОшибки));

		Возврат Ложь;

	КонецПопытки;

КонецФункции

// Получает список всей номенклатуры из выпусков за период
//
// Параметры:
//   НачалоПериода - Дата - начало периода
//   КонецПериода - Дата - конец периода
//
// Возвращаемое значение:
//   Массив - список СправочникСсылка.Номенклатура
//
Функция ПолучитьСписокНоменклатурыЗаПериод(НачалоПериода, КонецПериода, Пересчитать = Ложь) Экспорт

	Запрос = Новый Запрос;
	Если Пересчитать Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлючиАналитики.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО ВыпускПродукции.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка		
		|ГДЕ
		|	ВыпускПродукции.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлючиАналитики.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втВыпуск
		|ИЗ
		|	РегистрНакопления.ВыпускПродукции КАК ВыпускПродукции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО ВыпускПродукции.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
		|ГДЕ
		|	ВыпускПродукции.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлючиАналитики.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втЗакешированы
		|ИЗ
		|	РегистрСведений.ikon_cost_ДетализацияЗатратСебестоимости КАК Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
		|		ПО Данные.АналитикаУчетаПродукции = КлючиАналитики.Ссылка
		|ГДЕ
		|	Данные.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	выпуск.Номенклатура КАК Номенклатура
		|ИЗ
		|	втВыпуск КАК выпуск
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗакешированы КАК кэш
		|		ПО (кэш.Номенклатура = выпуск.Номенклатура)
		|ГДЕ
		|	кэш.Номенклатура ЕСТЬ NULL";
	КонецЕсли;

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат.ВыгрузитьКолонку("Номенклатура");

КонецФункции

#КонецОбласти
